{"type":"data","nodes":[{"type":"data","data":[{"categories":1},[2,3,4,5,6,7,8,9,10,11,12,13,14],"programming","ui","design","software","life","macos","multiplatform","games","tools","photography","proxmox","linux","windows"],"uses":{},"slash":"always"},{"type":"data","data":[{"articles":1,"slug":20},[2,11],{"slug":3,"path":4,"code":5,"fm":6},"lcatdb","/articles/lcatdb","\u003Cscript context=\"module\">\n\texport const metadata = {\"title\":\"Retrospective: lcatDB\",\"date\":\"2023-05-18T00:00:00.000Z\",\"categories\":\"programming life software ui\"};\n\tconst { title, date, categories } = metadata;\n\u003C/script>\n\u003Cscript lang=\"ts\">\n    import Image from \"$lib/Image.svelte\";\n    import Video from \"$lib/Video.svelte\";\n    import Figure from \"$lib/Figure.svelte\";\n    \n    import imgLogin1 from \"./localhost_3000_login.html.png?as=run\";\n    import imgLogin2 from \"./localhost_3000_login.html (1).png?as=run\";\n    import vidResponsive from \"./lcatDB Responsive Demo.mp4\";\n    import vidPages from \"./lcatDB Pages Demo.mp4\";\n\u003C/script>\n\n\u003Cp>lcatDB (Lake Champlain Anglers’ Temperature Database) was an online database and single page application (SPA) meant to provide a centralized means of recording, accessing, and analyzing vertical water temperature profiles to citizens of the Lake Champlain region. It was supported by the SUNY Plattsburgh Center for Earth & Environmental Science and the Lake Champlain Sea Grant. lcatDB was (what I consider to be) my first attempt at full stack software development. While the app never really took off and is no longer around today, I was able to demonstrate many of my strengths and learned several valuable lessons.\u003C/p>\n\u003Ch1>Client\u003C/h1>\n\u003CFigure>\n    \u003CImage src={imgLogin1} />\n    \u003CImage src={imgLogin2} />\n\u003C/Figure>\n\u003Cp>The UI of lcatDB very closely follows Google’s (now aged) Material Design guidelines. A hamburger menu is always available for root-level navigation and all elements are kept large, touch-friendly, and readable. Subtle iconography and color is used to draw attention to important elements and differentiate options. One element that I take pride in across most of my projects is responsive CSS, allowing for automatic adaptations to mobile, tablet, and desktop layouts.\u003C/p>\n\u003CFigure>\n    \u003CVideo src={vidResponsive} />\n\u003C/Figure>\n\u003Cp>lcatDB’s client was built using several JavaScript libraries, frameworks, and related tools, including:\u003C/p>\n\u003Cul>\n\u003Cli>Grunt (build system)\u003C/li>\n\u003Cli>Cordova (Android/iOS builds)\u003C/li>\n\u003Cli>jQuery\u003C/li>\n\u003Cli>Bootstrap\u003C/li>\n\u003Cli>Leaflet\u003C/li>\n\u003Cli>Mustache (for page templating)\u003C/li>\n\u003C/ul>\n\u003Cp>The client is structured as a SPA, and thus can run offline (albeit with some restrictions). An event queue was added to allow for offline operations to be uploaded to the server later, which was a required use-case due to poor cell service in the middle of the lake. Below is a video demo of various features and interactions!\u003C/p>\n\u003CFigure>\n    \u003CVideo src={vidPages} />\n\u003C/Figure>\n\u003Ch1>Server-Side\u003C/h1>\n\u003Cp>The server is probably the least interesting to talk about, but still quite important! It’s written for Node.JS and uses a mongoDB database to store users, readings, sensor information, and various other data! It provides a REST API and, in addition to serving the static pages (the same ones available offline), it uses mustache templates to provide pages for content only accessible online. I’ll talk more about this system later and my thoughts on its use.\u003C/p>\n\u003Cp>Passwords are stored as bcrypt hashes for essential user security. Users authenticate using \u003Ca\n  href=\"https://hacks.mozilla.org/2012/12/using-secure-client-side-sessions-to-build-simple-and-scalable-node-js-applications-a-node-js-holiday-season-part-3/\"\n  rel=\"nofollow\"\n>client sessions\u003C/a> which can be invalidated (logged out) server-side in case of certain user actions (eg. password resets). To ensure the accountability of data while providing basic editing features, edits to sensor information are tracked using mongoDB middleware and made visible to users. These are just some examples of security considerations made during development.\u003C/p>\n\u003Ch1>What I Would Do Differently\u003C/h1>\n\u003Cp>First of all, revisiting this codebase after working in Python 3 primarily for a few years and getting used to type annotations and IntelliSense… ouch. Very frequently I have to trace the flow of control manually with \u003Ccode>console.log\u003C/code>s and a lot of reading. I would definitely switch to TypeScript nowadays as things would be much more navigable. However, there’s a lot of deeper issues than that. Some of these arose due to the simple passage of time: some libraries and tools get adopted and maintained, some don’t.\u003C/p>\n\u003Cp>Firstly, lets address the use of Grunt. At the time of using it, it was relatively well-supported and I got used to it fairly quickly. The ability to mix JS scripting into your build system has a lot of benefits, though maybe a bit encouraging of hacky-ness. Nowadays, Grunt is pretty much dead. No releases in 2 years, and its mainly been surpassed by webpack. I’ve taken the hint and also begun migrating some of my older projects to webpack.\u003C/p>\n\u003Cp>Some issues, however, arose from my own inexperience. The biggest pill to swallow from this project is: it’s time to move on from jQuery and onto a proper framework. They’re infinitely less prone to breaking, with less time spent programming destructor functions and chasing bugs. jQuery’s purpose still feels mostly limited to small sites that need some dumb small feature quick and you don’t wanna deal with the poor syntax of vanilla JS, which between TS IntelliSense and AI code suggestions isn’t really even a problem anymore.\u003C/p>\n\u003Cp>Which leads to the root of that issue: \u003Cem>lcatDB did not originally plan to be a SPA\u003C/em>. That was added after many of the pages were implemented and the code was written, so the SPA capabilities were hacked on top. jQuery does not suit itself well in this use case, but at the time I couldn’t justify the time as a single developer to go back and start from scratch. And with the scale of the project growing further in a small scope-creep, the problems from jQuery scaled up as well. Despite the amount of time I spent considering my options for libraries and platforms, the change in scope caused a pile-up of other issues. This was the single-biggest takeaway: nail down the entire set of specifications first, then implement. Be very specific and thorough. Even then, it’s still easier said than done; at the time I didn’t even know what questions to ask.\u003C/p>\n\n",{"title":7,"date":8,"categories":9,"last_modified_at":10},"Retrospective: lcatDB",["Date","2023-05-18T00:00:00.000Z"],"programming life software ui","2024-12-04T14:57:02-05:00",{"slug":12,"path":13,"code":14,"fm":15},"responsive-design","/articles/responsive-design","\u003Cscript context=\"module\">\n\texport const metadata = {\"title\":\"Responsive Design Showcase\",\"date\":\"2023-05-18T00:00:00.000Z\",\"categories\":\"programming ui design\",\"last_modified_at\":\"2023-05-19T00:00:00.000Z\"};\n\tconst { title, date, categories, last_modified_at } = metadata;\n\u003C/script>\n\u003Cscript lang=\"ts\">\n    import Image from \"$lib/Image.svelte\";\n    import Video from \"$lib/Video.svelte\";\n    import Figure from \"$lib/Figure.svelte\";\n\n    import vidWhiteface from \"./Whiteface Responsive Demo.mp4\";\n    import vidLcatDB from \"./lcatDB Responsive Demo.mp4\";\n    import vidHeyjoeway from \"./heyjoeway Responsive Demo.mp4\";\n\u003C/script>\n\n\u003Cp>Here’s a mainly visual showcase of some of my work in responsive design!\u003C/p>\n\u003CFigure>\n    \u003CVideo src={vidWhiteface} />\n    \u003Cfigcaption slot=\"caption\">The Whiteface Tour is a 360-degree virtual tour of the Whiteface Mountain summit I developed using three.js. \u003Ca href=\"https://jojudge.com/whitefacetour\">Try it for yourself here!\u003C/a>\u003C/figcaption>\n\u003C/Figure>\n\u003CFigure>\n    \u003CVideo src={vidLcatDB} />\n    \u003Cfigcaption slot=\"caption\">lcatDB was a full-stack single-page application which I developed. \u003Ca href=\"/articles/lcatdb\">You can read more about it here.\u003C/a>\u003C/figcaption>\n\u003C/Figure>\n\u003CFigure>\n    \u003CVideo src={vidHeyjoeway} />\n    \u003Cfigcaption slot=\"caption\">And last but not least, the site you're reading this on! Try it for yourself!\u003C/figcaption>\n\u003C/Figure>\n\n",{"title":16,"date":17,"categories":18,"last_modified_at":19},"Responsive Design Showcase",["Date","2023-05-18T00:00:00.000Z"],"programming ui design",["Date","2023-05-19T00:00:00.000Z"],"ui"],"uses":{"params":["slug"]}}]}
